Repository: NeoCoderMatrix86/AudioCuesheetEditor
Catalog: AudioCuesheetEditor/Shared/Dialogs/GenerateExportDialog.*.resx
Languages: de

source: Configure export
de: Export konfigurieren

source: Export is currently not possible:
de: Export ist derzeit nicht möglich:

source: Select export profile
de: Exportprofil auswählen

source: Add new export profile
de: Neues Exportprofil hinzufügen

source: Delete selected export profile
de: Ausgewähltes Exportprofil löschen

source: Enter the name for this profile here
de: Geben Sie hier den Namen für dieses Profil ein

source: Filename
de: Dateiname

source: Enter the filename for this profile here
de: Geben Sie hier den Dateinamen für dieses Profil ein

source: Scheme head
de: Schema Kopf

source: Enter the header scheme for this profile here
de: Geben Sie hier das Kopf-Schema für dieses Profil ein

source: Add placeholder
de: Platzhalter hinzufügen

source: Scheme tracks
de: Schema Titel

source: Enter the tracks scheme for this profile here
de: Geben Sie hier das Spuren-Schema für dieses Profil ein

source: Scheme footer
de: Schema Fuß

source: Enter the footer scheme for this profile here
de: Geben Sie hier das Fuß-Schema für dieses Profil ein

source: Download export
de: Export herunterladen

source: Begin
de: Beginn

source: End
de: Ende

source: Content
de: Inhalt

source: Artist
de: Künstler

source: Title
de: Titel

source: CuesheetTitle
de: Cuesheet Titel

source: Performer
de: Interpret

source: Placeholder_Artist
de: Künstler

source: Placeholder_Title
de: Titel

source: Placeholder_Album
de: Album

source: Placeholder_CuesheetTitle
de: Cuesheet Titel

source: Placeholder_Performer
de: Interpret
