Repository: NeoCoderMatrix86/AudioCuesheetEditor
Catalog: AudioCuesheetEditor/Model/Entity/ValidationMessage.*.resx
Languages: de

source: Artist
de: Künstler

source: Audiofile
de: Audiodatei

source: Begin
de: Beginn

source: Cataloguenumber
de: Katalognummer

source: CuesheetFilename
de: Cuesheetdateiname

source: End
de: Ende

source: Filename
de: Dateiname

source: Length
de: Länge

source: Scheme
de: Schema

source: SchemeCuesheet
de: Schema Cuesheet

source: SchemeFooter
de: Schema Fuß

source: SchemeHead
de: Schema Kopf

source: SchemeTracks
de: Schema Titel

source: Title
de: Titel

source: Track({0},{1},{2},{3},{4}) does not have the correct position '{5}'!
de: Titel ({0},{1},{2},{3},{4}) hat nicht die korrekte Position '{5}'!

source: Tracks
de: Titel

source: {0} contains no placeholder!
de: {0} enthält keine Platzhalter!

source: {0} contains placeholder '{1}' that can not be resolved!
de: {0} enthält Platzhalter '{1}' die nicht verwendet werden können!

source: {0} has an invalid length. Allowed length is {1}!
de: {0} hat eine ungültige Länge. Erlaubte Länge ist {1}!

source: {0} has invalid Count ({1})!
de: {0} hat ungültige Anzahl ({1})!

source: {0} has no value!
de: {0} hat keinen Wert!

source: {0} may not be 0!
de: {0} darf nicht 0 sein!

source: {0} must be equal or greater zero!
de: {0} muss größer oder gleich 0 sein!

source: {0} must end with '{1}'!
de: {0} muss mit '{1}' enden!

source: {0} must have a filename!
de: {0} muss einen Dateinamen haben!

source: {0} must only contain numbers!
de: {0} darf nur Zahlen enthalten!

source: {0} should be greater than or equal '{1}'!
de: {0} muss größer oder gleich '{1}' sein!

source: {0} should be less than or equal '{1}'!
de: {0} muss kleiner oder gleich '{1}' sein!

source: {0} {1} '{2}' is used also by {3}({4},{5},{6},{7},{8}). Positions must be unique!
de: {0} {1} '{2}' wird auch von {3}({4},{5},{6},{7},{8}) genutzt. Positionen müssen eindeutig sein!

source: {0}({1},{2},{3},{4},{5}) is overlapping with {0}({6},{7},{8},{9},{10}). Please make shure the timeinterval is only used once!
de: {0}({1},{2},{3},{4},{5}) überlappt mit {0}({6},{7},{8},{9},{10}). Bitte stellen Sie sicher, dass die Zeitspanne nur einmal genutzt wird!
