{
  "culture": "de",
  "translations": {
    "Help": "Hilfe",
    "Quick links": "Schnellzugriff",
    "Introduction": "Einleitung",
    "What is AudioCuesheetEditor": "Was ist AudioCuesheetEditor?",
    "Features": "Funktionen",
    "Validation": "Validierung",
    "Track linking": "Track Kopplung",
    "Create cuesheet": "Cuesheet erstellen",
    "Import of files": "Import von Dateien",
    "Import of textfiles": "Import von Textdateien",
    "Import of cuesheetfiles": "Import von Cuesheetdateien",
    "Recordmode": "Aufnahmemodus",
    "Options": "Optionen",
    "Scroll to top": "Nach oben springen",
    "What is AudioCuesheetEditor helptext": "<strong>AudioCuesheet</strong> ist eine Web Applikation für das Schreiben von Audio Cuesheet Dateien. Audio Cuesheet Dateien sind kleine Textdateien, die Informationen über die Audiodatei bereit stellen, wie etwa z.B. Künstler, Titel, aber auch Anfang und Ende. AudioCuesheetEditor ist eine Applikation die Ihnen dabei helfen soll, gültige und korrekte Cuesheets zu erhalten. Sie können außerdem auch fertige Dateien importieren, um ihre Arbeit zu minimieren. Außerdem können Sie die gesammelten Daten auch in verschiedene, individuelle Exportformate überführen.",
    "Features helptext": "<ul><li>Validierung aller Daten</li><li>Verschiedene Importmöglichkeiten (Text, Cuesheet, Projektdateien)</li><li>Verschiedene Export Möglichkeiten (XML/CSV,Text, etc)</li><li>Audio Wiedergabe</li><li>Aufnahmemodus</li><li>Rückgängig/Wiederherstellen von Änderungen</li><li>Massenänderungen</li><li>Offlinefähigkeit (als Progressive WebApp)</li></ul>",
    "Validation helptext": "AudioCuesheetEditor arbeitet mit einem validiertem Datenmodell und prüft jede Eingabe. In den meisten Fällen werden Validierungsfehler neben den Eingabefeldern angezeigt, um Ihnen eine klare Information zu ermöglichen.",
    "Track linking helptext": "Es ist möglich einen Track mit dem vorherigen Track zu koppeln. Dies stellt sicher, dass Änderungen an Beginn, Ende und Position automatisch in den anschließenden Track übertragen werden.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/TrackLinking1_de.png\"/></div>Wenn ein Track mit dem vorherigen Track gekoppelt ist, können Sie beispielsweise das Ende verändern und ihre Änderung wird automatisch in den nachfolgenden Track bei Beginn eingetragen. Wenn Sie die Kopplung aufheben möchten, klicken sie einfach auf den orangfarbenenen \"Abkoppeln\" Button. Wenn Sie anschließend die Kopplung wiederherstellen möchten, klicken Sie einfach auf den grünen \"Koppeln\" Button.",
    "Create cuesheet helptext": "Cuesheets können sehr einfach und schnell mit der vorhandenen Eingabemaske erstellt werden. Dafür füllen Sie einfach CD Künstler und CD Titel in den vorhandenen Feldern aus. Wählen Sie bitte außerdem eine Audio Datei aus indem Sie eine Datei aus ihrem Datei System auf die Ablagefläche ziehen oder die Datei manuell mit dem Auswahldialog auswählen.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/CreateCuesheet1_de.png\"/></div>Anschließend können Sie einen Track hinzufügen indem Sie den \"Neuen Track hinzufügen\" Button klicken. Ein neuer Track wird angezeigt und sie können seine Eigenschaften wie Künstler, Titel, Beginn, Ende oder Länge bearbeiten. Bitte beachten Sie, dass der Beginn jedes Tracks von seinem vorherigen Ende automatisch berechnet wird. Daher ist es ratsam, einen weiteren Track erst dann hinzuzufügen, wenn alle Daten ausgefüllt sind.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/CreateCuesheet2_de.png\"/></div>Wenn Sie alle Tracks hinzugefügt haben, die in der Audio Datei vorhanden sind und alle notwendigen Felder ausgefüllt haben, können Sie das Cuesheet herunterladen indem Sie auf \"Export\" klicken und dann auf \"Cuesheet herunterladen\". Außerdem können Sie die Daten auch in anderen Formaten herunterladen, indem Sie auf \"Export\" und dann auf \"Export Profile anzeigen\" klicken.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/CreateCuesheet3_de.png\"/></div>",
    "Import of textfiles helptext": "Sie können Textdatein importieren und den Inhalt zeilenweise mit regulären Ausdrücken auswerten. Eine einfache Beispiel Textdatei kann <a href=\"samples/Sample_Inputfile.txt\" download>hier</a> gefunden werden.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/SampleInputfile1.png\"/></div>Jede Zeile repräsentiert einen Track, die erste Zeile jedoch Cuesheet Details und jedes Detail kann aus einer Zeile ausgelesen werden. Die erste Information ist der Track Künstler gefolgt von \" - \" und dem Track Titel. Dann kommen ein paar Tabs und Informationen über das Track Ende. So benötigen wir in diesem Beispiel den Regulären Ausdruck \"(?'Track.Artist'[a-zA-Z0-9_ .();äöü&:,]{1,}) - (?'Track.Title'[a-zA-Z0-9_ .();äöü]{1,})\t{1,}(?'Track.End'.{1,})\" für Tracks und \"(?'Cuesheet.Artist'\\A.*) - (?'Cuesheet.Title'\\w{1,})\t{1,}(?'Cuesheet.Audiofile'.{1,})\" für Cuesheet Details. Jedes Feld kann mit \"Entität.Feldname\" erreicht werden. Sie können den Textimport einfach starten, indem Sie in den Anzeigemodus \"Import Assistent\" wechseln und dort eine Datei aus dem Dateisystem auf die Ablagefläche zieht oder sie manuell über den Dateiauswahldialog auswählt.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile1_de.png\"/></div>Der Assistent wechselt nach der Analyse der Daten in die Detailansicht und sie können den Textimport verändern und so anpassen, dass er zu ihrer Textdatei passt und alle Informationen erfasst werden können.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile2_de.png\"/></div>Änderungen am Import Textschema verändern die Vorschau und spiegeln das Ergebnis wieder.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile3_de.png\"/></div>Sie können alle gültigen Platzhalter eines Tracks erreichen, indem Sie \"Platzhalter auswählen\" anklicken und dann den Platzhalter den Sie benötigen.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile4_de.png\"/></div>Wenn Sie ein ungültiges Import Textschema angeben, wird ihnen ein Validierungsfehler angezeigt.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile8_de.png\"/></div>Geben Sie ein Schema an, dass nicht zur Textdatei passt, wird ihnen ein Fehler angezeigt.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile5_de.png\"/></div>Fehler blockieren immer den Import und müssen korrigiert werden.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile6_de.png\"/></div>Wenn Sie nur Tracks importieren möchten, lassen Sie das Schema für Cuesheet leer und geben Sie eine Textdatei an, die nur Trackdetails enthält. Ein Beispiel kann <a href=\"samples/Sample_Inputfile2.txt\" download>hier</a> gefunden werden.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/SampleInputfile2.png\"/></div>Der Import kann nach dem gleichem Muster stattfinden.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile9_de.png\"/></div>",
    "Import of cuesheetfiles helptext": "Sie können bereits fertige Cuesheets importieren und bearbeiten. Dabei ist es nicht wichtig, woher die Datei stammt (von diesem oder einem anderen Programm), sondern nur das Format. Um ein Cuesheet zu importieren, wechseln sie über \"Anzeigemodus auswählen\" in den \"Import Assisstent\", ziehen Sie es aus ihrem Dateisystem auf die Ablagefläche oder wählen Sie es manuell über den Dateiauswahldialog:<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportCuesheet1_de.png\"/></div>Anschließend wird Ihnen das Ergebnis der Analyse der Datei angezeigt und Sie können die Daten prüfen und verändern.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportCuesheet2_de.png\"/></div>Durch klicken von \"Angezeigte Daten importieren\" werden die Daten in das eigentliche Cuesheet übernommen und Sie kommen in die ursprüngliche Bearbeitung zurück. <div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportCuesheet3_de.png\"/></div>Ein Beispielcuesheet kann <a href=\"samples/Sample_Cuesheet.cue\" target=\"_blank\">hier</a> gefunden werden.",
    "Recordmode helptext": "AudioCuesheetEditor hat verschiedene Ansichten für verschiedene Zielgruppen. Der Aufnahmemodus richtet sich an Leute, die in Echtzeit ein Cuesheet aufnehmen möchten und dabei Tracks mitschreiben, sowie anschließend eventuell die Audio Datei herunterladen möchten. Um den Aufnahmemodus zu verwenden, wechseln Sie den Ansichtsmodus auf Aufnahmemodus.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode1_de.png\"/></div>Sie werden gefragt, ob Sie der Applikation Zugriff auf ihre Audio Eingabegeräte erlauben wollen. Wenn Sie eine Aufnahme erzeugen möchten, die Sie später herunterladen möchten, wählen Sie hier bitte \"Zulassen\". Dies ist nicht zwingend erforderlich, jedoch kann kein Audiosignal mitgeschnitten werden, wenn Sie dies nicht erlauben. AudioCuesheetEditor speichert Audiodaten im WebM Format. Sie können anschließend die Aufnahme mit \"Aufnahme starten\" beginnen. Dies sorgt dafür, dass die Aufnahme beginnt und ihnen ein roter Balken mitteilt, dass die Aufnahme aktiv ist. Sie können alternativ den Button \"Aufnahmecountdown starten\" benutzen, um einen konfigurierbaren Countdown zu starten, bis die Aufnahme aktiv ist.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode2.png\"/></div>Beginnen Sie mit der Wiedergabe ihrer Audiostücke und sobald ein Track beendet ist, geben Sie die Daten Künstler und Titel ein und klicken Sie auf \"Neuen Track hinzufügen\". Dies fügt den neuen Track hinzu und setzt das Ende des aktuellen Tracks, sowie den Anfang des neuen Tracks. Sie können auch die \"Enter\" Taste auf dem Keyboard benutzen, um die Eingabefelder automatisch zu wechseln, bzw. den Track hinzuzufügen.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode3_de.png\"/></div>Sobald ein neuer Track hinzugefügt wurde, wird er unter Tracks angezeigt und Sie können dort nachträglich Künstler und Artist verändern, sowie ihn wieder löschen.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode4_de.png\"/></div>Wenn Sie mit der Aufnahme fertig sind, beenden Sie diese mit einem Klick auf \"Aufnahme beenden\". Das stoppt die Aufnahme und macht die Aufnahme zum Download verfügbar, sofern der Zugriff auf Audiogeräte erlaubt wurde.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode5_de.png\"/></div>Sie können nun zur vollen Bearbeitung wechseln und alle Änderungen am Cuesheet durchführen, die noch offen sind. Außerdem können Sie die Datei unter den Cuesheet Daten herunterladen.",
    "Options helptext": "AudioCuesheetEditor stellt viele Optionen bereit, um sich ihren Bedürfnissen anzupassen.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Options1_de.png\"/></div><h3>Sprache</h3>Sie können ihre Sprache auswählen.<br/><h3>Standard Anzeigemodus</h3>Setzt den standardmäßig genutzten Anzeigemodus, mit dem die Applikation startet.<br/><h3>Cuesheet Dateiname</h3>Stellt den standardmäßigen Dateinamen für ein Cuesheet ein, der beim Download genutzt wird.<br/><h3>Projektdateiname</h3>Stellt den standardmäßigen Dateinamen für ein Projekt ein, der beim Download genutzt wird.<br/><h3>Tracks standardmäßig koppeln</h3>Setzt den Standardwert, ob Tracks automatisch gekoppelt werden oder nicht.<h3>Angepasstes Zeitspannenformat</h3>Hier können sie das Standard Zeitspannenformat überschreiben. Das ist immer dann sinnvoll, wenn ihre Eingaben beispielsweise nur Minuten und Sekunden enthalten, statt Stunden, Minuten und Sekunden. Angegeben wird das Format als regulärer Ausdruck. Ein Beispiel für Zeitformate mit Minuten und Sekunden ist \"(?'TimeSpanFormat.Minutes'\\d{1,})[:](?'TimeSpanFormat.Seconds'\\d{1,})\", womit beispielsweise Eingaben von \"63:12\" als Zeitformat erkannt werden.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Options3_de.png\"/></div><h3>Dateiname für aufgenommene Audiodaten</h3>Gibt den standardmäßig genutzten Dateinamen für die Audiodatei bei Benutzung des Aufnahmemodus an.<h3>Aufnahmecountdown in Sekunden</h3>Geben Sie an, wie viele Sekunden der Countdown laufen soll, bevor die Aufnahme aktiv geschaltet wird.<h3>Genauigkeit der Aufnahmezeiten</h3>Wählen Sie aus, wie die Aufnahmezeiten dargestellt werden sollen.",
    "Export of data": "Exportmöglichkeiten",
    "Export of data helptext": "Es ist sehr einfach in AudioCuesheetEditor alle Eingaben zu exportieren. Sie können den Export selbst anpassen und selbstständig eigene Exportprofile anlegen. Wenn Sie ein Cuesheet exportieren möchen, klicken sie einfach auf \"Export Profile anzeigen\" im oberen Bereich im Menü \"Export\".<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Export1_de.png\"/></div>Es öffnet sich der Exportprofil Dialog bei dem Sie jederzeit zwischen den verschiedenen Exportprofilen wechseln können, sowie alte löschen und neue anlegen. Jede Änderung wird automatisch gespeichert. Sie können einen Namen vergeben, einen Dateinamen für den Download, sowie die Schema für Kopf, Fuß und Tracks verändern. <div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Export2_de.png\"/></div>Alle gültigen Platzhalter können eingefügt werden, indem man sie manuell tippt oder den Button \"Platzhalter auswählen\" und den Platzhalter anklickt den man hinzufügen möchte. Sie können außerdem Text zwischen den Platzhaltern angeben, der nicht ersetzt wird.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Export3_de.png\"/></div>Sobald sie das Exportprofil benutzen möchten, klicken sie einfach auf den Button \"Exportdatei herunterladen\" und der Export wird vorgenommen.",
    "User Interface": "Benutzeroberfläche",
    "User Interface helptext": "<h3>Automatische Vervollständigung</h3>AudioCuesheetEditor bietet ihnen die Möglichkeit die Daten von Tracks automatisch vervollständigen zu lassen. Die verwendete Musikdatenbank ist MusicBrainz. Dazu geben Sie einen Track ein und erhalten hier bereits Vorschläge.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_MusicBrainz1_de.png\"/></div>Wählen Sie einen gültigen Interpreten aus, so werden Ihnen beim Eingeben des Titels passende Vorschläge gemacht.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_MusicBrainz2_de.png\"/></div>Wenn sie einen Titel ausgewählt haben, wird die Länge automatisch übernommen.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_MusicBrainz3_de.png\"/></div><h3>Massenänderungen</h3>AudioCuesheetEditor bietet ihnen die Möglichkeit mehrere Tracks gleichzeit zu bearbeiten. Wählen Sie dazu einfach mehrere Tracks in der Übersicht aus (über \"Auswahl für Tracks einblenden\") und klicken auf \"Selektierte Tracks bearbeiten\".<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_BulkEdit1_de.png\"/></div>Der Bearbeitungsdialog öffnet sich und sie können wählen, ob die Bearbeitung dynamisch angewendet werden soll (Wert erhöhen oder verringern) oder der eingebene Wert absolut verwendet werden soll (für einige Eigenschaften). Dabei bedeutet \"=\" dass der absolute Wert übernommen werden soll, \"-\" dass der Wert abgezogen werden soll und \"+\" dass der Wert addiert werden soll.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_BulkEdit2_de.png\"/></div>",
    "Shortcuts": "Tastenkürzel",
    "Shortcuts helptext": "Die folgenden Tastenkürzeln sind verfügbar:<ul><li>Strg + p: Startet oder pausiert die Audiowiedergabe</li><li>Play: Startet oder pausiert die Audiowiedergabe</li><li>Strg + Left: Vorherigen Track wiedergeben</li><li>Previous: Vorherigen Track wiedergeben</li><li>Strg + Right: Nächsten Track wiedergeben</li><li>Next: Nächsten Track wiedergeben</li><li>Stop: Stoppt die Audiowiedergabe</li><li>Strg + z: Letzte Änderung rückgängig machen</li><li>Strg + y: Letzte Änderung wiederherstellen</li><li>Strg + h: Navigiere zu dieser Hilfe</li><li>Strg + e: Öffne die Exportprofile</li><li>Strg + s: Speicher das Projekt (Download als Datei)</li></ul>",
    "Sections": "Abschnitte",
    "Sections helptext": "<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Sections1_de.png\"/></div>Abschnitte ermöglichen es ein Cuesheet in mehrere Dateien aufzuteilen. Dies ist z.B. beim Import aus einer Textdatei hilfreich, um das Projekt in mehrere Dateien aufzuteilen. Abschnitte können im Anzeigemodus \"Komplette Bearbeitung\" und \"Aufnahmemodus\" angegeben werden.",
    "Offline usage (progressive WebApp)": "Offlinefähigkeit (Progressive WebApp)",
    "Offline usage helptext": "AudioCuesheetEditor ist eine progressive WebApp und kann auf ihrem Gerät lokal installiert werden, um ohne Internetverbindung genutzt zu werden. Um die Applikation zu installieren folgen Sie bitte den Anweisungen ihres Browsers. Üblicherweise ist in der Adresszeile ein Hinweis zu finden, dass die Applikation lokal installiert werden kann."
  }
}