{
  "culture": "en",
  "translations": {
    "Help": "Help",
    "Quick links": "Quick links",
    "Introduction": "Introduction",
    "What is AudioCuesheetEditor": "What is AudioCuesheetEditor?",
    "Features": "Features",
    "Validation": "Validation",
    "Track linking": "Track linking",
    "Create cuesheet": "Create a Cuesheet",
    "Import of files": "Import of files",
    "Import of textfiles": "Import of text files",
    "Import of cuesheetfiles": "Import of cuesheet files",
    "Recordmode": "Live record mode",
    "Options": "Options",
    "Scroll to top": "Scroll to top",
    "What is AudioCuesheetEditor helptext": "<strong>AudioCuesheet</strong> is a web application for writting audio cuesheet files. Audio cuesheet files are little text files which provide information about the provided audio file like for example artist, name, but also start and end. AudioCuesheetEditor is an application that helps you writting valid cuesheet files by checking and validation input data. You can also import data from files to minimize your work. Exporting data to individual formats is also possible.",
    "Features helptext": "<ul><li>Validation for all data</li><li>Several import options (Text, Cuesheet, Projectfiles)</li><li>Several export profiles (XML/CSV,Text, etc)</li><li>Audio playback</li><li>Live record mode</li><li>Undo/Redo changes</li><li>Bulk edit</li></ul>",
    "Validation helptext": "AudioCuesheetEditor works with a validation model and evaluates every input. In most cases the validation messages are presented next to the input, giving you a clear instruction what is missing.",
    "Track linking helptext": "It is possible to link a track with the previous track. This makes shure, that changes to Begin,End and Position are automatically transfered to the next following track. <img style=\"width:100%\" src=\"images/TrackLinking1.png\"/> If a track is linked to the previous track, you can change for example the End and the Begin of the following linked track is automatically replaced with the End you entered. If you wish to disable linking, just click on the orange \"Unlink\" Button. If you afterwards want to link the tracks again, just hit the green \"Link\" Button.",
    "Create cuesheet helptext": "Creation of Cuesheet can be done very easily and fast using the standard GUI without import of files. To do so, enter the CD artist and CD title in the appropriate fields. Also select an audio file on your computer by draging the file from file explorer to the drop zone or manually selecting the file via file chooser.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/CreateCuesheet1_en.png\"/></div>Afterwards you need to insert a track by clickin the \"Add new track\" button. A new track is added and you can edit its properties like Artist, Title or Begin, End or Length. Please keep in mind, that every tracks begin gets calculated from the end of the previous track. Therefore its adviced to edit one track and fill its data before adding a new one.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/CreateCuesheet2_en.png\"/></div>When you have added all tracks from the audio file and filled all necessary fields, you can export the cuesheet in the top by clickin \"Export\" and then \"Download cuesheet\". You can also export the result in other formats like XML, CSV or text by clicking \"Export\" and then \"Display Export Profiles\".<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block mx-auto d-block\" src=\"images/CreateCuesheet3_en.png\"/></div>",
    "Import of textfiles helptext": "You can import plain text files and analyse the content of each line by simple regular expressions. A simple sample textfile can be found <a href=\"samples/Sample_Inputfile.txt\" download>here</a>.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/SampleInputfile1.png\"/></div>Each line represents a track, but the first line represents cuesheet details and every detail can be extracted from the line. First information that can be found is the track artist, followed by \" - \" and then track title. Afterwards some tabs come and you can see information about the track end time. So in this example we can work with the regular expression for tracks \"%?'Track.Artist'[a-zA-Z0-9_ .();äöü&:,]{1,}) - (?'Track.Title'[a-zA-Z0-9_ .();äöü]{1,})\t{1,}(?'Track.End'.{1,})\" and with \"(?'Cuesheet.Artist'\\A.*) - (?'Cuesheet.Title'\\w{1,})\t{1,}(?'Cuesheet.Audiofile'.{1,})\" for cuesheet data. Each field can be accessed via \"Entity.Fieldname\".You can start importing a textfile by selecting viewmode \"Import asssistant\" and drag the file from filesystem to the dropzone or by manually selecting it from file chooser dialog.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile2_en.png\"/></div>Changing the import textscheme will result in changes of the import result and the data to import will be shown to you.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile3_en.png\"/></div>You can select the valid fields by pressing the button \"Select placeholder\" and afterwards selecting the placeholder you want to add.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile4_en.png\"/></div>If you enter an invalid text import scheme, a validation error will be displayed.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile8_en.png\"/></div>If the import scheme doesn't match the text file, an error will be displayed to you.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile5_en.png\"/></div>Errors will always block import of text, so you have to correct them at first before import can take place.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile6_en.png\"/></div>If you want to import a tracks only textfile, just leave the cuesheet scheme empty and add a textfile with track properties only. A sample can be found <a href=\"samples/Sample_Inputfile2.txt\" download>here</a>.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/SampleInputfile2.png\"/></div>Import can be done the same way.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportTextfile9_en.png\"/></div>",
    "Import of cuesheetfiles helptext": "You can import already finished cuesheets and edit them. It doesn't matter if the cuesheet is written by this program or another one. Only the format of file matters. To import a cuesheet, switch via \"Select viewmode\" to \"Import assistant mode\", drag a cuesheet from your file system to the dropzone or manually select it via file system chooser:<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportCuesheet1_en.png\"/></div>Afterwards the result of file analysis will be displayed and you can check and edit data to your needs.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportCuesheet2_en.png\"/></div>By clicking \"Import the displayed data\" the result will be imported to the main cuesheet and you come back to the main edit form.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/ImportCuesheet3_en.png\"/></div>A sample cuesheet file can be found <a href=\"samples/Sample_Cuesheet.cue\" target=\"_blank\">here</a>.",
    "Recordmode helptext": "AudioCuesheetEditor has different view modes you can use for different scopes. Record mode has the focus on live recording a cuesheet and tracks with a soundfile you can download afterwards. To use the record mode switch the view mode to record mode.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode1_en.png\"/></div>You will be asked if you want to allow using audio input. In case you want to have the audio recorded select \"Allow\". This is optional, but keep in mind, that if you block access to audio, no audio will be recorded by AudioCuesheetEditor. AudioCuesheetEditor records audio data in WebM format. You can afterwards start your recording by pressing the \"Start recording\" Button. This causes the record to start and a display will tell you, that you are currently recording. You can also use the \"Start record countdown timer\" Button in order to have a customizable countdown before recording is started.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode2.png\"/></div>Play audio and once the end of the track has been reached, please enter the track artist and title and click the button \"Add new track\". This will set the end of the track to the current time. You can use \"Enter\" on the input fields to fast switch the focus inputs and enter the new track.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode3_en.png\"/></div>Once you have entered a track, it will display in the tracks and you can edit artist and title again and also delete the track afterwards.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode4_en.png\"/></div>Once you have finished your recording, click the button \"Stop recording\" which will stop the recording and make the recording (if audio is not blocked) downloadable to you.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/RecordMode5_en.png\"/></div>You can now switch back to full edit mode in order to do more editing on the cuesheet. All tracks are present and also the recording is available as download in the cuesheet data part.",
    "Options helptext": "AudioCuesheetEditor provides several options you can use to customize the application to your fits.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Options1_en.png\"/></div><h3>Language</h3>You can select your language.<br/><h3>Default view mode</h3>Sets the default view mode the application starts with.<br/><h3>Cuesheet filename</h3>Sets the default cuesheet filename that is used, when you download the cuesheet.<br/><h3>Project filename</h3>Set the default project filename that is used, when you download the projectfile.<br/><h3>Automatically link tracks</h3>Sets the default value, if tracks should be automatically linked or not.<h3>Customized timespan format</h3>With this option you can change the default timespan format. This is useful, if your input contains only minutes and seconds and not hours, minutes and seconds. The format needs is entered as regular expression. A sample for a timespan format with minutes and seconds is \"(?'TimeSpanFormat.Minutes'\\d{1,})[:](?'TimeSpanFormat.Seconds'\\d{1,})\" which recognizes input of \"63:12\" as timeformat also.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Options3_en.png\"/></div><h3>Audio filename of recording</h3>Sets the default filename used for recording if audio capture is activated.<h3>Record countdown timer in seconds</h3>Enter how much seconds you want to use for countdown, if using countdown timer record mode.<h3>Recordtime sensitivity</h3>Select how recording times will be represented.",
    "Export of data": "Export of data",
    "Export of data helptext": "Exporting all entered data is really easy in AudioCuesheetEditor. You can customize the export yourself and also can add new export profiles by yourself. Once you have a cuesheet you want to export, just click on the \"Display Export Profiles\" Button in the top menu bar inside \"Export\".<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Export1_en.png\"/></div>The export profiles dialog comes up, where you can easily switch between the current export profiles, delete and add new export profiles. Each change to export profile will get saved automatically. You can enter a name for the profile, a filename for download and the scheme for header, footer and tracks.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Export2_en.png\"/></div>All valid placeholders can be added by manually typing them or selecting the \"Select placeholder\" button and click on the placeholder you want to add. You can also add text between placeholders that will not get touched by the export logic.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/Export3_en.png\"/></div>Once you want to use the export profile, just click on the \"Download export file\" button and the export will be generated for you.",
    "User Interface": "User interface",
    "User Interface helptext": "<h3>Autocomplete</h3>AudioCuesheetEditor has an build autocomplete feature for tracks. The data used come from MusicBrainz. Adding a Track and enter an artist to receive autocomplete suggestions.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_MusicBrainz1_en.png\"/></div>Select a valid artist and you will get suggestions for title also.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_MusicBrainz2_en.png\"/></div>If you select a title, the length will automatically be set.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_MusicBrainz3_en.png\"/></div><h3>Bulk edit</h3>AudioCuesheetEditor offers you the possibility to edit multiple tracks at once. Simply choose the tracks you want to edit in overview (via \"Display selection of tracks\") and click \"Edit selected tracks\".<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_BulkEdit1_en.png\"/></div>Edit dialog will appear and you can choose if you want to edit values dynamically (add or subtract value) or statically (entered value will be applied). \"=\" means that the absolute value is applied, \"-\" means that the value is subtracted and \"+\" means that the value is added.<div class=\"container-fluid\"><img class=\"img-fluid img-thumbnail mx-auto d-block\" src=\"images/UserInterface_BulkEdit2_en.png\"/></div>",
    "Shortcuts": "Shortcuts",
    "Shortcuts helptext": "The following shortcuts are available:<ul><li>Ctrl + p: Starts or pauses playback of the audio file</li><li>Play: Starts or pauses playback of the audio file</li><li>Ctrl + Left: Play previous track</li><li>Previous: Play previous track</li><li>Ctrl + Right: Play next track</li><li>Next: Play next track</li><li>Stop: Stops the playback of the audio file</li><li>Ctrl + z: Undo the last edit</li><li>Ctrl + y: Redo the last edit</li><li>Ctrl + h: Navigate to this help</li><li>Ctrl + e: Open the export profiles</li><li>Ctrl + s: Save the project (download as project file)</li></ul>"
  }
}