{
  "culture": "en",
  "translations": {
    "Help": "Help",
    "Quick links": "Quick links",
    "Introduction": "Introduction",
    "What is AudioCuesheetEditor": "What is AudioCuesheetEditor?",
    "Features": "Features",
    "Validation": "Validation",
    "Track linking": "Track linking",
    "Create cuesheet": "Create a Cuesheet",
    "Import of files": "Import of files",
    "Import of textfiles": "Import of text files",
    "Import of cuesheetfiles": "Import of cuesheet files",
    "Recordmode": "Live record mode",
    "Options": "Options",
    "Scroll to top": "Scroll to top",
    "What is AudioCuesheetEditor helptext": "<strong>AudioCuesheet</strong> is a web application for writting audio cuesheet files. Audio cuesheet files are little text files which provide information about the provided audio file like artist, name, etc. AudioCuesheetEditor is an application that helps you writting valid cuesheet files by checking and validation input data. You can also import data from files to minimize your work.",
    "Features helptext": "<ul><li>Validation for all data</li><li>Textimport</li><li>Cuesheet import</li><li>Different export profiles (XML/CSV,Text, etc)</li><li>Audio playback</li><li>Live record mode</li><li>Undo/Redo changes</li></ul>",
    "Validation helptext": "AudioCuesheetEditor works with a validation model and evaluates every input. Currently there are 2 types of validation: Warning and Error. Warnings are validationmessages, that might be important for you, but don't block functions. Errors are validationmessages that need to be corrected (like tracks with invalid times). Validation messages are displayed on the right with link to the corresponding field.<br/><img style=\"width:100%\" src=\"images/Validation1.png\"/><br/>Each message can be clicked to jump to the corresponding field and correct the field.<br/><img style=\"width:100%\" src=\"images/Validation2.png\"/>",
    "Track linking helptext": "It is possible to link a track with the previous track. This makes shure, that changes to Begin,End and Position are automatically transfered to the next following track. <img style=\"width:100%\" src=\"images/TrackLinking1.png\"/> If a track is linked to the previous track, you can change for example the End and the Begin of the following linked track is automatically replaced with the End you entered. If you wish to disable linking, just click on the orange \"Unlink\" Button. If you afterwards want to link the tracks again, just hit the green \"Link\" Button.",
    "Create cuesheet helptext": "Creation of Cuesheet can be done very easily and fast using the standard GUI without import of files. To do so, enter the CD artist and CD title in the appropriate fields. Also select an audio file on your computer by draging the file from file explorer to the drop zone or manually selecting the file via file chooser. <br /><img style=\"width:100%\" src=\"images/CreateCuesheet1.png\"/><br/>Afterwards you need to insert a track by clickin the \"Add new track\" button. A new track is added and you can edit its properties like Artist, Title or Begin, End or Length. Please keep in mind, that every tracks begin gets calculated from the end of the previous track. Therefore its adviced to edit one track and fill its data before adding a new one.<br /><img style=\"width:100%\" src=\"images/CreateCuesheet2.png\"/><br/>When you have added all tracks from the audio file and filled all necessary fields, you can export the cuesheet in the top by clickin \"Export result\" and then \"Download cuesheet file\". You can also export the result in other formats like XML, CSV or text by clicking \"Export result\" and then \"Display Export Profilfes\".<br/><img style=\"width:100%\" src=\"images/CreateCuesheet3.png\"/>",
    "Import of textfiles helptext": "You can import plain text files and analyse the content of each line by simple regular expressions. A simple sample textfile can be found <a href=\"samples/Sample_Inputfile.txt\" target=\"_blank\">here</a>.<br/><img style=\"width:100%\" src=\"images/SampleInputfile1.png\"/><br/>Each line represents a track, but the first line represents cuesheet details and every detail can be extracted from the line. First information that can be found is the track artist, followed by \" - \" and then track title. Afterwards some tabs come and you can see information about the track end time. So in this example we can work with the regular expression for tracks \"%Artist% - %Title%[\t]{1,}%End%\" and with \"\\A.*%Cuesheet.Artist% - %Cuesheet.Title%[\t]{1,}%Cuesheet.AudioFile%\" for cuesheet data. Each field can be accessed via \"%Fieldname%\". You can start importing a textfile by dragging it from the file system to the dropzone or by manually selecting it from file chooser dialog.<br/><img style=\"width:100%\" src=\"images/ImportTextfile1.png\"/><br/>A new dialog will appear where you can see the result of import and can edit the regular expression for import to your favor to match all the details you have in the textfile.<br/><img style=\"width:100%\" src=\"images/ImportTextfile2.png\"/><br/>Changing the import textscheme will result in changes of the import result and the data to import will be shown to you.<br/><img style=\"width:100%\" src=\"images/ImportTextfile3.png\"/><br/>You can select the valid  fields by pressing the button \"Select placeholder\" and afterwards selecting the placeholder you want to add:<br/><img style=\"width:100%\" src=\"images/ImportTextfile4.png\"/><br/>If you enter an invalid text import scheme, a validation error will be displayed.<br /><img style=\"width:100%\" src=\"images/ImportTextfile8.png\"/><br />If the import scheme doesn't match the text file, an error will be displayed to you:<br/><img style=\"width:100%\" src=\"images/ImportTextfile5.png\"/><br/>Errors will always block import of text, so you have to correct them at first before import can take place.<br/><img style=\"width:100%\" src=\"images/ImportTextfile6.png\"/><br/>Afterwards you can import the textfile and see the result.<br/><img style=\"width:100%\" src=\"images/ImportTextfile7.png\"/><br/>If you want to import a tracks only textfile, just leave the cuesheet scheme empty and add a textfile with track properties only. A sample can be found <a href=\"samples/Sample_Inputfile2.txt\" target=\"_blank\">here</a>.<br/><img style=\"width:100%\" src=\"images/SampleInputfile2.png\"/><br/>Import can be done the same way.<br/><img style=\"width:100%\" src=\"images/ImportTextfile9.png\"/><br/>",
    "Import of cuesheetfiles helptext": "You can import already finished cuesheets and edit them. It doesn't matter if the cuesheet is written by this program or another one. Only the format of file matters. To import a cuesheet, simply drag it from your file system to the dropzone or manually select it via file system chooser:<br/><img style=\"width:100%\" src=\"images/ImportCuesheet1.png\"/><br/>A confirmation will be required, since all of the exisiting data will be replaced.<br/><img style=\"width:100%\" src=\"images/ImportCuesheet2.png\"/><br/>Confirming this dialog will import the cuesheet and afterwards display the result.<br/><img style=\"width:100%\" src=\"images/ImportCuesheet3.png\"/><br/>A sample cuesheet file can be found <a href=\"samples/Sample_Cuesheet.cue\" target=\"_blank\">here</a>.",
    "Recordmode helptext": "AudioCuesheetEditor has different view modes you can use for different scopes. Record mode has the focus on live recording a cuesheet and tracks with a soundfile you can download afterwards. To use the record mode switch the view mode to record mode.<br/><img style=\"width:100%\" src=\"images/RecordMode1.png\"/><br/>You will be asked if you want to allow using audio input. In case you want to have the audio recorded select \"Allow\". This is optional, but keep in mind, that if you block access to audio, no audio will be recorded by AudioCuesheetEditor. AudioCuesheetEditor records audio data default in WebM format. If you want to switch the audio format after recording, please check the options. You can afterwards start your recording by pressing the \"Start recording\" Button. This causes the record to start and a display will tell you, that you are currently recording. You can also use the \"Start record countdown timer\" Button in order to have a customizable countdown before recording is started.<br/><img style=\"width:100%\" src=\"images/RecordMode2.png\"/><br/>Play audio and once the end of the track has been reached, please enter the track artist and title and click the button \"Add new track\". This will set the end of the track to the current time. You can use \"Enter\" on the input fields to fast switch the focus inputs and enter the new track.<br/><img style=\"width:100%\" src=\"images/RecordMode3.png\"/><br/>Once you have entered a track, it will display in the tracks and you can edit artist and title again and also delete the track afterwards.<br/><img style=\"width:100%\" src=\"images/RecordMode4.png\"/><br/>Once you have finished your recording, click the button \"Stop recording\" which will stop the recording and make the recording (if audio is not blocked) downloadable to you. <br/><img style=\"width:100%\" src=\"images/RecordMode5.png\"/><br/>You can now switch back to full edit mode in order to do more editing on the cuesheet. All tracks are present and also the recording is available as download in the cuesheet data part.",
    "Options helptext": "AudioCuesheetEditor provides several options you can use to customize the application to your fits. <br/><img style=\"width:100%\" src=\"images/Options1.png\"/><br/><h3>Language</h3>You can select your language.<br/><h3>Default view mode</h3>Sets the default view mode the application starts with.<br/><h3>Cuesheet filename</h3>Sets the default cuesheet filename that is used, when you download the cuesheet.<br/><h3>Project filename</h3>Set the default project filename that is used, when you download the projectfile.<br/><h3>Automatically link tracks</h3>Sets the default value, if tracks should be automatically linked or not.<br/><img style=\"width:100%\" src=\"images/Options2.png\"/><br/><h3>Textimport regular expression for cuesheet properties</h3>Set the default import scheme that is used for importing a textfile for setting the cuesheet properties.<br/><h3>Textimport regular expression for track properties</h3>Set the default import scheme that is used for importing a textfile for analysing the tracks.<br/><img style=\"width:100%\" src=\"images/Options3.png\"/><br/><h3>Audio filename of recording</h3>Sets the default filename used for recording if audio capture is activated.<h3>Record countdown timer in seconds</h3>Enter how much seconds you want to use for countdown, if using countdown timer record mode.<h3>Recordtime sensitivity</h3>Select how recording times will be represented.",
    "Export of data": "Export of data",
    "Export of data helptext": "Exporting all entered data is really easy in AudioCuesheetEditor. You can customize the export yourself and also can add new export profiles by yourself. Once you have a cuesheet you want to export, just click on the \"Display Export Profiles\" Button in the top menu bar inside \"Export\". <br/><img style=\"width:100%\" src=\"images/Export1.png\"/><br/>The export profiles dialog comes up, where you can easily switch between the current export profiles, delete and add new export profiles. Each change to export profile will get saved automatically. You can enter a name for the profile, a filename for download and the scheme for header, footer and tracks.<br/><img style=\"width:100%\" src=\"images/Export2.png\"/><br/>All valid placeholders can be added by manually typing them or selecting the \"Select placeholder\" button and click on the placeholder you want to add. You can also add text between placeholders that will not get touched by the export logic.<br/><img style=\"width:100%\" src=\"images/Export3.png\"/><br/>Once you want to use the export profile, just click on the \"Download\" button and the export will be generated for you."
  }
}