Repository: NeoCoderMatrix86/AudioCuesheetEditor
Catalog: AudioCuesheetEditor/Shared/ResourceFiles/Localization.*.resx
Languages: de

# HasInvalidCount
source: {0} has invalid Count ({1})!
de: {0} hat eine ungültige Menge ({1})!

# Files
source: Files (optional)
de: Dateien (optional)

# ValidationDescription
source: Here all validation messages will be displayed. Each message contains a reference to the corresponding field and can be clicked to enter the field.
de: Hier werden alle Validierungsnachrichten angezeigt. Jede Nachricht enthält eine Referenz auf das ursprüngliche Feld und kann daher angeklickt werden, um zu dem entsprechenden Feld zu gelangen.

# RecordControl
source: Control recording
de: Aufnahmesteuerung

source: Start recording
de: Aufnahme starten

source: Stop recording
de: Aufnahme beenden

source: Switch view mode
de: Anzeigemodus auswählen

# ViewModeFull
source: Full edition
de: Komplette Bearbeitung

# ViewModeRecord
source: Record mode
de: Aufnahmemodus

source: Default view mode
de: Standard Anzeigemodus

# RecordRunning
source: Record is running!
de: Aufnahme aktiv!

source: Enter new Track
de: Neuen Track eingeben

# RecordNotPossibleWithExistingTracks
source: The cuesheet already contains tracks. Recording is not possible when there are tracks present in the cuesheet. Please save your work and start with a clean cuesheet.
de: Das cuesheet enthält bereits Tracks. Die Aufnahme ist nicht möglich, wenn bereits Tracks vorhanden sind. Bitte speichern Sie ihre Arbeit und starten Sie anschließend mit einem leeren Cuesheet.

# DownloadRecordedAudio
source: Download recorded audio file
de: Aufnahme herunterladen

# RecordMode
source: Live record mode
de: Aufnahmemodus

# RecordModeHelpText
source: AudioCuesheetEditor has different view modes you can use for different scopes. Record mode has the focus on live recording a cuesheet and tracks with a soundfile you can download afterwards. To use the record mode switch the view mode to record mode.<br/><img src="images/RecordMode1.png"/><br/>You will be asked if you want to allow using audio input. In case you want to have the audio recorded select "Allow". This is optional, but keep in mind, that if you block access to audio, no audio will be recorded by AudioCuesheetEditor. You can afterwards start your recording by pressing the "Start recording" Button. This causes the record to start and a display will tell you, that you are currently recording.<br/><img src="images/RecordMode2.png"/><br/>Play audio and once the end of the track has been reached, please enter the track artist and title and click the button "Add new track". This will set the end of the track to the current time. You can use "Enter" on the input fields to fast switch the focus inputs and enter the new track.<br/><img src="images/RecordMode3.png"/><br/>Once you have entered a track, it will display in the tracks and you can edit artist and title again and also delete the track afterwards.<br/><img src="images/RecordMode4.png"/><br/>Once you have finished your recording, click the button "Stop recording" which will stop the recording and make the recording (if audio is not blocked) downloadable to you. <br/><img src="images/RecordMode5.png"/><br/>You can now switch back to full edit mode in order to do more editing on the cuesheet. All tracks are present and also the recording is available as download in the cuesheet data part.
de: AudioCuesheetEditor hat verschiedene Ansichten für verschiedene Zielgruppen. Der Aufnahmemodus richtet sich an Leute, die in Echtzeit ein Cuesheet aufnehmen möchten und dabei Tracks mitschreiben, sowie anschließend eventuell die Audio Datei herunterladen möchten. Um den Aufnahmemodus zu verwenden, wechseln Sie den Ansichtsmodus auf Aufnahmemodus.<br/><img src="images/RecordMode1.png"/><br/>Sie werden gefragt, ob Sie der Applikation Zugriff auf ihre Audio Eingabegeräte erlauben wollen. Wenn Sie eine Aufnahme erzeugen möchten, die Sie später herunterladen möchten, wählen Sie hier bitte "Zulassen". Dies ist nicht zwingend erforderlich, jedoch kann kein Audiosignal mitgeschnitten werden, wenn Sie dies nicht erlauben. AudioCuesheetEditor speichert Audiodaten standardmäßig im WebM Format. Wenn sie ein anderes AudioFormat wünschen, können Sie dies in den Optionen verändern. Sie können anschließend die Aufnahme mit "Aufnahme starten" beginnen. Dies sorgt dafür, dass die Aufnahme beginnt und ihnen ein roter Balken mitteilt, dass die Aufnahme aktiv ist.<br/><img src="images/RecordMode2.png"/><br/>Beginnen Sie mit der Wiedergabe ihrer Audiostücke und sobald ein Track beendet ist, geben Sie die Daten Künstler und Titel ein und klicken Sie auf "Neuen Track hinzufügen". Dies fügt den neuen Track hinzu und setzt das Ende des aktuellen Tracks, sowie den Anfang des neuen Tracks. Sie können auch die "Enter" Taste auf dem Keyboard benutzen, um die Eingabefelder automatisch zu wechseln, bzw. den Track hinzuzufügen.<br/><img src="images/RecordMode3.png"/><br/>Sobald ein neuer Track hinzugefügt wurde, wird er unter Tracks angezeigt und Sie können dort nachträglich Künstler und Artist verändern, sowie ihn wieder löschen. <br/><img src="images/RecordMode4.png"/><br/>Wenn Sie mit der Aufnahme fertig sind, beenden Sie diese mit einem Klick auf "Aufnahme beenden". Das stoppt die Aufnahme und macht die Aufnahme zum Download verfügbar, sofern der Zugriff auf Audiogeräte erlaubt wurde.<br/><img src="images/RecordMode5.png"/><br/>Sie können nun zur vollen Bearbeitung wechseln und alle Änderungen am Cuesheet durchführen, die noch offen sind. Außerdem können Sie die Datei unter den Cuesheet Daten herunterladen.

# EditTrack
source: Edit track details
de: Trackdetails bearbeiten

# EditTrackTooltip
source: Edit track details in a dialog
de: Trackdetails in einem Dialog bearbeiten

# Flag4CHTooltip
source: Set this if track contains four channel audio
de: Setzen Sie diese Markierung, wenn der Track 4 Kanal Audio enthält

# FlagDCPTooltip
source: Set this if track is digital copy permitted
de: Setzen Sie diese Markierung, wenn digitale Kopien verboten sind

# FlagPRETooltip
source: Set this if track has Pre-emphasis enabled
de: Setzen Sie diese Markierung, wenn der Track Höhenanhebung hat

source: Flags
de: Markierungen

# FlagSCMSTooltip
source: Set this if track has "Serial Copy Management System"
de: Setzen Sie diese Markierung, wenn der Track "Serial Copy Management System" hat

# CopyTrackTooltip
source: Copy this track with all values and attach it to the cuesheet.
de: Kopiere diesen Track mit allen Werten und füge ihn anschließend zum Cuesheet hinzu.

# PositionAlreadyInUse
source: Position {0} of this track is already in use by track(s) {1}!
de: Position {0} von diesem Track ist bereits in Benutzung durch Track(s) {1}!

# TimeIsOverlapping
source: {0} is overlapping with other tracks ({1})!
de: {0} überschneidet sich mit anderen Tracks ({1})!

source: Postgap
de: Nachlücke

source: Pregap
de: Vorlücke
