Repository: NeoCoderMatrix86/AudioCuesheetEditor
Catalog: AudioCuesheetEditor/Shared/ResourceFiles/Localization.*.resx
Languages: de

source: Abort
de: Abbrechen

source: About
de: Über

source: About AudioCuesheetEditor
de: Über AudioCuesheetEditor

source: Add identifier to import scheme
de: Platzhalter zum Importschema hinzufügen

source: Add new export profile
de: Neues Exportprofil hinzufügen

source: Add new track
de: Neuen Track hinzufügen

# AddPlaceholderToExportSchemeFooter
source: Add placeholder to the export footer scheme
de: Platzhalter zum Fuß Export Schema hinzufügen

# AddPlaceholderToExportSchemeHead
source: Add placeholder to the export head scheme
de: Platzhalter zum Kopf Export Schema hinzufügen

# AddPlaceholderToExportSchemeTrack
source: Add placeholder to the export track scheme
de: Platzhalter zum Track Export Schema hinzufügen

source: Artist
de: Künstler

source: Audiofile
de: Audio Datei

source: Audio player
de: Wiedergabe

source: CD artist
de: CD Künstler

source: CD title
de: CD Titel

source: Change
de: Ändern

# ChooseFileOrDrag
source: <strong>Choose files</strong><span> or drag them here</span>
de: <strong>Wählen Sie die Dateien</strong><span> oder ziehen Sie diese hier her</span>

source: Close
de: Schließen

source: Confirm
de: Bestätigen

# ConfirmDeleteOfAllTracks
source: Do you really want to delete all tracks? This can not be reversed.
de: Möchten Sie wirklich alle Tracks löschen? Dies kann nicht rückgängig gemacht werden.

# ConfirmImportCuesheet
source: Do you really want to import this file? This can not be reversed and unsaved changes are lost!
de: Möchten Sie wirklich diese Datei importieren? Dies kann nicht rückgängig gemacht werden und ungespeicherte Änderungen gehen verloren!

# ConfirmRequired
source: Confirmation required
de: Bestätigung erforderlich

# ConfirmResetCuesheet
source: Do you really want to reset the cuesheet? This can not be reversed.
de: Möchten Sie wirklich das Cuesheet zurücksetzen? Dies kann nicht rückgangig gemacht werden.

# ConfirmRestartOfApplication
source: Please confirm, that you want to restart the whole application. All data will be lost if not saved before!
de: Bitte Bestätigen Sie, dass die komplette Anwendung neugestartet werden soll. Alle ungespeicherten Änderungen werden dadurch verloren!

# CreateCuesheet
source: Create a Cuesheet
de: Cuesheet erstellen

source: Cuesheet data
de: Cuesheet Daten

source: Cuesheet result
de: Cuesheet Ergebnis

# CultureSetting
source: Language:
de: Sprache:

# CurrentTrackIsPlayed
source: This track is played
de: Dieser Track wird aktuell wiedergegeben

source: Decline
de: Abbrechen

source: Delete all tracks
de: Alle Tracks löschen

# DeleteExportProfile
source: Delete current export profile
de: Aktuelles Exportprofil löschen

# DeleteTrackTooltip
source: Delete this track
de: Diesen Track löschen

# DescribeHowTheErrorOccured
source: Please describe how the error occured: 1.What were you trying to do? 2.Does this error occure, if you try it again?
de: Bitte beschreiben Sie, wie der Fehler aufgetreten ist: 1.Was haben Sie vor dem Fehler gemacht? 2.Tritt der Fehler erneut auf, wenn Sie es nochmal versuchen?

source: Donate for this project
de: Spenden Sie für dieses Projekt

# Downloadcuesheet
source: Download cuesheet file
de: Cuesheet herunterladen

# DownloadExport
source: Download export file
de: Exportdatei herunterladen

# DropFiles
source: Drop input files here
de: Eingabedateien hier her ziehen

source: End
de: Ende

source: Enter audiofile here
de: Audio Datei auswählen

source: Enter CD artist here
de: CD Künstler eingeben

source: Enter CD title here
de: CD Titel eingeben

# EnterExportProfileFilenameHere
source: Enter name of file for export profile here
de: Geben Sie hier den Dateinamen für das Exportprofil an

# EnterExportProfileNameHere
source: Enter name of export profile here
de: Geben Sie hier den Namen des Exportprofils an

# EnterExportSchemeFooterHere
source: Enter scheme for export of footer here
de: Bitte geben Sie hier das Fuß Schema für den Export an

# EnterExportSchemeFooterHereTooltip
source: Enter scheme for export of footer here. Each placeholder will be replaced by the placeholder value. Placeholder start and end with %.
de: Bitte geben Sie hier das Fuß Schema für den Export an. Jeder Platzhalter wird durch seinen zugehörigen Wert ersetzt. Platzhalter beginnen und enden mit %.

# EnterExportSchemeHeadHere
source: Enter scheme for export of header here
de: Bitte geben Sie hier das Kopf Schema für den Export an

# EnterExportSchemeHeadHereTooltip
source: Enter scheme for export of header here. Each placeholder will be replaced by the placeholder value. Placeholder start and end with %.
de: Bitte geben Sie hier das Kopf Schema für den Export an. Jeder Platzhalter wird durch seinen zugehörigen Wert ersetzt. Platzhalter beginnen und enden mit %.

# EnterExportSchemeTrackHere
source: Enter scheme for export of tracks here
de: Bitte geben Sie hier das Track Schema für den Export an

# EnterExportSchemeTrackHereTooltip
source: Enter scheme for export of tracks here. Each placeholder will be replaced by the placeholder value. Placeholder start and end with %.
de: Bitte geben Sie hier das Track Schema für den Export an. Jeder Platzhalter wird durch seinen zugehörigen Wert ersetzt. Platzhalter beginnen und enden mit %.

# ErrorDuringTextImport
source: An error occured during text import
de: Ein Fehler ist während des Textimport aufgetreten

source: Error report
de: Fehlerbericht

source: Errors
de: Fehler

source: Exception
de: Ausnahme

# ExceptionOccuredPleaseFillErrorReport
source: An internal exception has occured and the application has stopped working. Please fill out the error report and send it to the developer, so the Bug can get fixed.
de: Es ist ein interner Fehler aufgetetreten und die Anwendung wurde gestoppt. Bitte füllen Sie den Fehlerbericht aus und senden Sie ihn an die Entwickler, damit der Fehler behoben werden kann.

# ExportProfileFilename
source: Filename
de: Dateiname

# ExportProfileIsNotExportable
source: Export profile is not exportable. Please check the validation errors and fix them in order to download the export.
de: Export Profil ist nicht exportierbar. Bitte prüfen Sie die Validierungsfehler und beheben Sie diese, um die Exportdatei herunterzuladen.

source: Export Profiles
de: Export Profile

# ExportProfileSchemeFooter
source: Scheme footer
de: Schema Fuß

# ExportProfileSchemeFooterValidationErrors
source: Export profile footer scheme validation errors
de: ExportProfil Fuß Schema Validierungsfehler

# ExportProfileSchemeHead
source: Scheme header
de: Schema Kopf

# ExportProfileSchemeHeadValidationErrors
source: Export profile head scheme validation errors
de: ExportProfil Kopf Schema Validierungsfehler

# ExportProfileSchemeTrack
source: Scheme tracks
de: Schema Tracks

# ExportProfileSchemeTrackValidationErrors
source: Export profile track scheme validation errors
de: ExportProfil Track Schema Validierungsfehler

source: Export result
de: Ergebnis exportieren

# HasInvalidBegin
source: Begin is not valid (must be equal or greater than 00:00:00). Please enter a valid time.
de: Beginn ist nicht gültig (muss größer oder gleich 00:00:00 sein). Bitte geben Sie eine gültige Zeit an.

# HasInvalidEnd
source: End is not valid (must be equal or greater than 00:00:00). Please enter a valid time.
de: Ende ist nicht gültig (muss größer oder gleich 00:00:00 sein). Bitte geben Sie eine gültige Zeit an.

# HasInvalidValue
source: {0} has invalid value!
de: {0} hat einen ungültigen Wert!

# HasNoValue
source: {0} has no value!
de: {0} hat keinen Wert!

source: Help
de: Hilfe

# ImportCuesheetTooltip
source: Import a cuesheet file and extract all data from it
de: Importieren Sie ein Cuesheet und extrahieren Sie alle Daten daraus

source: Import files
de: Import aus vorhandenen Dateien

# ImportNotPossible
source: Import is not possible due to errors. Please check import errors!
de: Import ist nicht möglich, weil der Textimport Fehler aufweist. Bitte prüfen Sie die Fehler!

source: Import of files
de: Import von Dateien

# ImportTextfileTooltip
source: Import a plain text file and extract data via regular expressions
de: Textdatei importieren und Daten über reguläre Ausdrücke extrahieren

source: Introduction
de: Einleitung

# WhatIsAudioCuesheetEditorText
source: <strong>AudioCuesheet</strong> is a web application for writting audio cuesheet files. Audio cuesheet files are little text files which provide information about the provided audio file like artist, name, etc. AudioCuesheetEditor is an application that helps you writting valid cuesheet files by checking and validation input data. You can also import data from files to minimize your work.
de: <strong>AudioCuesheet</strong> ist eine Web Applikation für das Schreiben von Audio Cuesheet Dateien. Audio Cuesheet Dateien sind kleine Textdateien, die Informationen über die Audiodatei bereit stellen, wie etwa Künstler, Titel, etc. AudioCuesheetEditor ist eine Applikation die Ihnen dabei helfen soll, gültige und korrekte Cuesheets zu erhalten. Sie können außerdem auch fertige Dateien importieren, um ihre Arbeit zu minimieren.

source: Invalid file
de: Ungültige Datei

source: Length
de: Länge

# LengthHasNoValue
source: Length has no value! Please check Begin and End.
de: Länge hat keinen Wert! Bitte prüfen Sie Beginn und Ende.

source: Licence
de: Lizenz

# MoveTrackDownTooltip
source: Move this track one position down
de: Diesen Track eine Position nach unten schieben

# MoveTrackUpTooltip
source: Move this track one position up
de: Diesen Track eine Position nach oben schieben

source: Notifications
de: Hinweise

# OnceYouSubmitTheErrorReport
source: Once you submit the error report, you will get redirected to formspree.io. This is normal, since the error report will get send by them. Afterwards you can go back in browser history and use the application again. Thanks for your help!
de: Sobald Sie den Fehlerbericht abgesendet haben, werden die auf die Seite formspree.io weitergeleitet. Das ist normal, weil der Bericht dadurch versendet wird. Im Anschluss können Sie über die Browserhistorie wieder zurück gehen und die Applikation erneut benutzen. Vielen Dank für ihre Unterstützung!

# OpenExportProfilesDialog
source: Display Export Profiles
de: Export Profile anzeigen

# PlayNextTrackTooltip
source: Jump playback position to next track beginning
de: Wiedergabeposition auf Begin von nächstem Track setzen

# PlayPreviousTrackTooltip
source: Jump playback position to previous track beginning
de: Wiedergabeposition auf Begin von vorherigen Track setzen

# PleaseCheckProcessingHints
source: Please check processing hints for errors. Otherwise the file is not exportable.
de: Bitte prüfen sie die Bearbeitungshinweise auf Fehler. Andernfalls ist Datei nicht exportierbar.

source: Processing hints
de: Bearbeitungshinweise

source: Quick links
de: Schnellzugriff

source: Reset
de: Zurücksetzen

source: Reset cuesheet
de: Cuesheet zurücksetzen

source: Restart complete application
de: Komplette Anwendung neustarten

# SchemeContainsPlaceholdersThatCanNotBeSolved
source: Scheme contains placeholder that can not be resolved!
de: Schema enthält Platzhalter, die nicht aufgelöst werden können!

source: Select export profile
de: Exportprofil auswählen

source: Select placeholder
de: Platzhalter auswählen

source: Send
de: Abschicken

# StartPlaybackThisTrack
source: Start playing this track
de: Diesen Track wiedergeben

source: Textfile
de: Textdatei

# TextImportAssistance
source: Import textfile assistant
de: Importassistent für Textdateien

source: Title
de: Titel

# TrackHasInvalidValue
source: Track {0} has invalid Value {1} ({2})!
de: Track {0} hat einen ungültigen Wert {1} ({2})!

# TrackTableControls
source: Controls
de: Steuerung

source: Warning
de: Warnung

source: Warnings
de: Warnungen

source: What is AudioCuesheetEditor?
de: Was ist AudioCuesheetEditor?

# WrittenBy
source: Written by Sven Baus (<a href='mailto&#58;%73&#46;ba&#117;%7386%4&#48;g&#37;6D%78&#46;ne%&#55;4'>s&#46;baus8&#54;&#64;&#103;mx&#46;net</a>)
de: Entwickelt von Sven Baus (<a href='mailto&#58;%73&#46;ba&#117;%7386%4&#48;g&#37;6D%78&#46;ne%&#55;4'>s&#46;baus8&#54;&#64;&#103;mx&#46;net</a>)

# YouDroppedAFileThatCanNotBeProcessed
source: You selected or dropped a file ("{0}") that can not be processed. Please select only valid files (Textfiles, Cuesheets, Audiofiles)!
de: Sie haben eine ungültige Datei selektiert ("{0}"), die nicht verarbeitet werden kann. Bitte wählen Sie nur gültige Dateien (Textimportdateien, Cuesheets, Audiodateien)!

# YourEmailAddress
source: Your emailaddress (optional)
de: Ihre Emailaddresse (Optional)

# CreateCuesheetText
source: Creation of Cuesheet can be done very easily and fast using the standard GUI without import of files. To do so, enter the CD artist and CD title in the appropriate fields. Also select an audio file on your computer by draging the file from file explorer to the drop zone or manually selecting the file via file chooser. <br /><img src="images/CreateCuesheet1.png"/><br/>Afterwards you need to insert a track by clickin the "Add new track" button. A new track is added and you can edit its properties like Artist, Title or Begin, End or Length. Please keep in mind, that every tracks begin gets calculated from the end of the previous track. Therefore its adviced to edit one track and fill its data before adding a new one.<br /><img src="images/CreateCuesheet2.png"/><br/>When you have added all tracks from the audio file and filled all necessary fields, you can export the cuesheet in the top by clickin "Export result" and then "Download cuesheet file". You can also export the result in other formats like XML, CSV or text by clicking "Export result" and then "Display Export Profilfes".<br/><img src="images/CreateCuesheet3.png"/>
de: Cuesheets können sehr einfach und schnell mit der vorhandenen Eingabemaske erstllt werden. Dafür füllen Sie einfach CD Künstler und CD Titel in den vorhandenen Feldern aus. Wählen Sie bitte außerdem eine Audio Datei aus indem Sie eine Datei aus ihrem Datei System auf die Ablagefläche ziehen oder die Datei manuell mit dem Auswahldialog auswählen.<br /><img src="images/CreateCuesheet1.png"/><br/>Anschließend können Sie einen Track hinzufügen indem Sie den "Neuen Track hinzufügen" Button klicken. Ein neuer Track wird angezeigt und sie können seine Eigenschaften wie Künstler, Titel, Beginn, Ende oder Länge bearbeiten. Bitte beachten Sie, dass der Beginn jedes Tracks von seinem vorherigen Ende automatisch berechnet wird. Daher ist es ratsam, einen weiteren Track erst dann hinzuzufügen, wenn alle Daten ausgefüllt sind.<br /><img src="images/CreateCuesheet2.png"/><br/>Wenn Sie alle Tracks hinzugefügt haben, die in der Audio Datei vorhanden sind und alle notwendigen Felder ausgefüllt haben, können Sie das Cuesheet herunterladen indem Sie auf "Ergebnis exportieren" klicken und dann auf "Cuesheet herunterladen". Außerdem können Sie die Daten auch in anderen Formaten herunterladen, iden Sie auf "Ergebnis exportieren" und dann auf "Export profile anzeigen" klicken.<br/><img src="images/CreateCuesheet3.png"/>

source: Features
de: Funktionen

# FeaturesText
source: <ul><li>Validation for all data</li><li>Textimport</li><li>Cuesheet import</li><li>Different export profiles (XML/CSV,Text, etc)</li><li>Audio playback</li><li>Live record mode</li></ul>
de: <ul><li>Validierung aller Daten</li><li>Textimport</li><li>Cuesheet import</li><li>Verschiedene Export Möglichkeiten (XML/CSV,Text, etc)</li><li>Audio Wiedergabe</li><li>Aufnahmemodus</li></ul>

source: Validation
de: Validierung

# ValidationText
source: AudioCuesheetEditor works with a validation model and evaluates every input. Currently there are 2 types of validation: Warning and Error. Warnings are validationmessages, that might be important for you, but don't block functions. Errors are validationmessages that need to be corrected (like tracks with invalid times). Validation messages are displayed on the right with link to the corresponding field.<br/><img src="images/Validation1.png"/><br/>Each message can be clicked to jump to the corresponding field and correct the field.<br/><img src="images/Validation2.png"/>
de: AudioCuesheetEditor arbeitet mit einem validiertem Datenmodell und prüft jede Eingabe. Aktuell sind 2 Typen von Validierung bekannt: Warnung und Fehler. Warnungen sind Meldungen, die eventuell für Sie wichtig sind, jedoch keine Funktionen blockieren. Fehler sind Meldungen, die unbedingt behoben werden müssen (wie etwa Tracks mit ungültigen Zeiten). Validierungsmeldungen werden auf der rechten Seite angezeigt und verweisen auf die Datenfelder.<br/><img src="images/Validation1.png"/><br/>Jede Validierungsmeldung kann angeklickt werden, um zu dem entsprechenden Feld zu springen und das Feld zu korrigieren.<br/><img src="images/Validation2.png"/>

source: Import of cuesheet files
de: Import von Cuesheetdateien

source: Import of text files
de: Import von Textdateien

# ImportOfTextFilesText
source: You can import plain text files and analyse the content of each line by simple regular expressions. A simple sample textfile can be found <a href="/samples/Sample_Inputfile.txt" target="_blank">here</a>.<br/><img src="images/SampleInputfile1.png"/><br/>Each line represents a track and every detail can be extracted from the line. First information that can be found is the track artist, followed by " - " and then track title. Afterwards some tabs come and you can see information about the track end time. So in this example we can work with the regular expression "%Artist% - %Title%[\t]{1,}%End%". Each field of track can be accessed via "%Fieldname%". You can start importing a textfile by dragging it from the file system to the dropzone or by manually selecting it from file chooser dialog.<br/><img src="images/ImportTextfile1.png"/><br/>A new dialog will appear where you can see the result of import and can edit the regular expression for import to your favor to match all the details you have in the textfile.<br/><img src="images/ImportTextfile2.png"/><br/>Changing the import textscheme will result in changes of the import result and the data to import will be shown to you.<br/><img src="images/ImportTextfile3.png"/><br/>You can select the valid track fields by pressing the button "Select placeholder" and afterwards selecting the placeholder you want to add:<br/><img src="images/ImportTextfile4.png"/><br/>If you enter an invalid text import scheme, that doesn't match the text file, an error will be displayed to you:<br/><img src="images/ImportTextfile5.png"/><br/>Errors will always block import of text, so you have to correct them at first before import can take place. Afterwards you can import the textfile and see the result.<br/><img src="images/ImportTextfile6.png"/><br/><img src="images/ImportTextfile7.png"/><br/>
de: Sie können Textdatein importieren und den Inhalt zeilenweise mit regulären Ausdrücken auswerten. Eine einfache Beispiel Textdatei kann <a href="/samples/Sample_Inputfile.txt" target="_blank">hier</a> gefunden werden.<br/><img src="images/SampleInputfile1.png"/><br/>Jede Zeile repräsentiert einen Track und jedes Detail kann aus dieser Zeile ausgelesen werden. Die erste Information ist der Track Künstler gefolgt von " - " und dem Track Titel. Dann kommen ein paar Tabs und Informationen über das Track Ende. So benötigen wir in diesem Beispiel den Regulären Ausdruck "%Artist% - %Title%[\t]{1,}%End%". Jedes Feld eines Tracks kann mit "%Feldname%" erreicht werden. Sie können den Textimport einfach starten, indem man eine Datei aus dem Dateisystem auf die Ablagefläche zieht oder sie manuell über den Dateiauswahldialog wählt.<br/><img src="images/ImportTextfile1.png"/><br/>Ein neuer Dialog erscheint und zeigt das mögliche Ergebnis des Textimports. Außerdem können Sie den regulären Ausdruck für den Textimport verändern und so anpassen, dass er zu ihrer Textdatei passt und alle Informationen erfasst werden.<br/><img src="images/ImportTextfile2.png"/><br/>Änderungen am Import Textschema verändern die Vorschau und spiegeln das Ergebnis wieder.<br/><img src="images/ImportTextfile3.png"/><br/>Sie können alle gültigen Platzhalter eines Tracks erreichen, indem Sie "Platzhalter auswählen" anklicken und dann den Platzhalter den Sie benötigen:<br/><img src="images/ImportTextfile4.png"/><br/>Wenn Sie ein ungültiges Import Textschema angeben, dass nicht zur Textdatei passt, wird ihnen ein Fehler angezeigt:<br/><img src="images/ImportTextfile5.png"/><br/>Fehler blockieren immer den Import und müssen korrigiert werden. Im Anschluss kann das Ergebnis importiert werden und die Tracks sind vorhanden.<br/><img src="images/ImportTextfile6.png"/><br/><img src="images/ImportTextfile7.png"/><br/>

# ImportOfCuesheetFilesText
source: You can import already finished cuesheets and edit them. It doesn't matter if the cuesheet is written by this program or another one. Only the format of file matters. To import a cuesheet, simply drag it from your file system to the dropzone or manually select it via file system chooser:<br/><img src="images/ImportCuesheet1.png"/><br/>A confirmation will be required, since all of the exisiting data will be replaced.<br/><img src="images/ImportCuesheet2.png"/><br/>Confirming this dialog will import the cuesheet and afterwards display the result.<br/><img src="images/ImportCuesheet3.png"/><br/>A sample cuesheet file can be found <a href="samples/Sample_Cuesheet.cue" target="_blank">here</a>.
de: Sie können bereits fertige Cuesheets importieren und bearbeiten. Dabei ist es nicht wichtig, woher die Datei stammt (von diesem oder einem anderen Programm), sondern nur das Format. Um ein Cuesheet zu importieren, ziehen Sie es aus ihrem Dateisystem auf die Ablagefläche oder wählen Sie es manuell über den Dateiauswahldialog:<br/><img src="images/ImportCuesheet1.png"/><br/>Eine Bestätigung wird abgefragt, da alle vorhandenen Daten ersetzt werden.<br/><img src="images/ImportCuesheet2.png"/><br/>Das Bestätigen des Dialogs importiert das Cuesheet und im Anschluss ist das Ergebnis sichtbar.<br/><img src="images/ImportCuesheet3.png"/><br/>Ein Beispielcuesheet kann <a href="samples/Sample_Cuesheet.cue" target="_blank">hier</a> gefunden werden.

source: Scroll to top
de: Nach oben springen

# CuesheetfileImport
source: Import of Cuesheet
de: Cuesheetimport

source: Error
de: Fehler

# FileHasInvalidMimeType
source: The file "{0}" you supplied does not match the requested operation: "{1}". Please provide a valid file!
de: Die Datei "{0}" kann nicht für die angeforderte Operation verwendet werden: "{1}". Bitte nutzen Sie eine gültige, passende Datei!

source: Textfile import
de: Import Textdatei

source: CD Textfile
de: CD Textdatei

source: Catalogue number
de: Katalognummer

source: Cataloguenumber contains non digits.
de: Katalognummer enthält nicht nur Zahlen.

# EnterCatalogueNumberHere
source: Enter the catalogue number of the cuesheet. Catalogue number is a 13 decimal digits number.
de: Geben Sie hier die Katalognummer des Cuesheets an. Die Katalognummer ist eine 13 stellige Zahl.

# HasInvalidLength
source: {0} has invalid length({1})!
de: {0} hat eine ungültige Länge ({1})!

source: Filename:
de: Dateiname:

# ConfirmResetOfApplication
source: Please confirm, that you want to reset the whole application. All data will be reset and the application will be reloaded. Every unchanged data will be lost!
de: Bitte Bestätigen Sie, dass die komplette Anwendung auf Werkseinstellungen zurückgesetzt werden soll. Alle Daten werden gelöscht und die Anwedung neu geladen. Alle nicht gespeicherten Daten sind gelöscht!

source: Options
de: Optionen

source: Reset complete application
de: Komplette Anwendung zurücksetzen

source: Cuesheet filename
de: Cuesheet Dateiname

source: Reload options
de: Optionen neu laden

source: Save
de: Speichern
